In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame({
    'employee' : [
              'Gray',
              'Stu',
              'Mary',
              'Sue' 
            ],
    'group' : ['Accounting', 'Marketing', 'Marketing', 'HR']
})
df1

  employee       group
0     Gray  Accounting
1      Stu   Marketing
2     Mary   Marketing
3      Sue          HR

In [4]:
df2 = pd.DataFrame({
    'employee' : [
              'Gray',
              'Stu',
              'Mary',
              'Sue' 
            ],
    'hire_date': [
              2008,
              2012,
              2017,
              2018
    ]
})
df2

  employee  hire_date
0     Gray       2008
1      Stu       2012
2     Mary       2017
3      Sue       2018

In [5]:
df_combined = pd.merge(df1,df2)

In [6]:
df_combined

  employee       group  hire_date
0     Gray  Accounting       2008
1      Stu   Marketing       2012
2     Mary   Marketing       2017
3      Sue          HR       2018

In [10]:
df3 = pd.DataFrame({
    'supervisor' : [
              'Carlos',
              'Giada',
              'Stephanie'
            ],
    'group' : ['Accounting', 'Marketing', 'HR']
})
df3

  supervisor       group
0     Carlos  Accounting
1      Giada   Marketing
2  Stephanie          HR

In [11]:
pd.merge(df_combined, df3)

  employee       group  hire_date supervisor
0     Gray  Accounting       2008     Carlos
1      Stu   Marketing       2012      Giada
2     Mary   Marketing       2017      Giada
3      Sue          HR       2018  Stephanie

In [12]:
pd.merge(df_combined, df3, on='group')

  employee       group  hire_date supervisor
0     Gray  Accounting       2008     Carlos
1      Stu   Marketing       2012      Giada
2     Mary   Marketing       2017      Giada
3      Sue          HR       2018  Stephanie

In [14]:
df4 = pd.DataFrame({
    'core_skills' : [
              'math',
              'spreadsheets',
              'writing',
              'communication',
              'spreadsheets',
              'organization'
            ],
    'group' : ['Accounting','Accounting', 'Marketing','Marketing', 'HR', 'HR']
})
df4

     core_skills       group
0           math  Accounting
1   spreadsheets  Accounting
2        writing   Marketing
3  communication   Marketing
4   spreadsheets          HR
5   organization          HR

In [15]:
df1

  employee       group
0     Gray  Accounting
1      Stu   Marketing
2     Mary   Marketing
3      Sue          HR

In [16]:
pd.merge(df1, df4, on='group')

  employee       group    core_skills
0     Gray  Accounting           math
1     Gray  Accounting   spreadsheets
2      Stu   Marketing        writing
3      Stu   Marketing  communication
4     Mary   Marketing        writing
5     Mary   Marketing  communication
6      Sue          HR   spreadsheets
7      Sue          HR   organization

In [18]:
right = pd.DataFrame({
    'id': [1,2,3,4,5],
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id' : ['sub2', 'sub4', 'sub3', 'sub6', 'sub5']
})
right

   id   Name subject_id
0   1  Billy       sub2
1   2  Brian       sub4
2   3   Bran       sub3
3   4  Bryce       sub6
4   5  Betty       sub5

In [19]:
left = pd.DataFrame({
    'id': [1,2,3,4,5],
    'Name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'],
    'subject_id' : ['sub1', 'sub2', 'sub4', 'sub6', 'sub5']
})
left

   id   Name subject_id
0   1  Billy       sub1
1   2  Brian       sub2
2   3   Bran       sub4
3   4  Bryce       sub6
4   5  Betty       sub5

In [20]:
pd.merge(left, right, on='subject_id', how='left')

   id_x Name_x subject_id  id_y Name_y
0     1  Billy       sub1   NaN    NaN
1     2  Brian       sub2   1.0  Billy
2     3   Bran       sub4   2.0  Brian
3     4  Bryce       sub6   4.0  Bryce
4     5  Betty       sub5   5.0  Betty

In [22]:
pd.merge(left, right, on='subject_id', how='inner')

   id_x Name_x subject_id  id_y Name_y
0     2  Brian       sub2     1  Billy
1     3   Bran       sub4     2  Brian
2     4  Bryce       sub6     4  Bryce
3     5  Betty       sub5     5  Betty

In [23]:
df5 = pd.DataFrame({
    'name': ['Gray',
              'Stu',
              'Mary',
              'Sue' ],
    'salary': [70000,80000,120000,90000]
})
df5

   name  salary
0  Gray   70000
1   Stu   80000
2  Mary  120000
3   Sue   90000

In [24]:
pd.merge(df1, df5, left_on='employee', right_on='name')

  employee       group  name  salary
0     Gray  Accounting  Gray   70000
1      Stu   Marketing   Stu   80000
2     Mary   Marketing  Mary  120000
3      Sue          HR   Sue   90000

In [27]:
series1 = pd.Series(['a', 'b', 'c'], index=[1,2,3])
series1

1    a
2    b
3    c
dtype: object

In [28]:
series2 = pd.Series(['d', 'e', 'f'], index=[4,5,6])

In [29]:
series2

4    d
5    e
6    f
dtype: object

In [30]:
pd.concat([series1, series2])

1    a
2    b
3    c
4    d
5    e
6    f
dtype: object

In [32]:
one = pd.DataFrame({
    'A': ['a', 'c'],
    'B': ['b', 'd']
})
one

   A  B
0  a  b
1  c  d

In [33]:
two = pd.DataFrame({
    'A': [1, 2],
    'B': [3, 4]
})
two

   A  B
0  1  3
1  2  4

In [34]:
pd.concat([one, two], ignore_index=True, axis=1)

   0  1  2  3
0  a  b  1  3
1  c  d  2  4

In [35]:
three = pd.DataFrame({
    'A': ['a', 'd'],
    'B': ['b', 'e'],    
    'C': ['c', 'f']

})
three

   A  B  C
0  a  b  c
1  d  e  f

In [36]:
four = pd.DataFrame({
    'B': ['u', 'x'],
    'C': ['v', 'y'],    
    'D': ['w', 'z']

})
four

   B  C  D
0  u  v  w
1  x  y  z

In [37]:
pd.concat([three, four])

     A  B  C    D
0    a  b  c  NaN
1    d  e  f  NaN
0  NaN  u  v    w
1  NaN  x  y    z

In [38]:
pd.concat([three, four], join='inner')

   B  C
0  b  c
1  e  f
0  u  v
1  x  y